{
    "type": "code_tax",
    "description": "Your troupe's journey leads you through a crossroads. Looking ahead you see a small crowd loitering there, starting to disperse and looking disgruntled. As you approach you see one man standing on a small box, arms outstretched, and looking oddly familiar. He appears to have been addressing the parting crowd. As you get closer, he steps down and a child takes his place with a sign that reads 'back in 5 minutes'. Your troupe stops here to rest. When the man returns, he wastes no time in addressing the crowd, which now consists entirely of you and your troupe. 'Today, I open your eyes,' he begins. He rambles for a few minutes about the fallacy of the gods. It is nothing you haven't heard before from many a crazed man or woman. But as you begin to tune out it gets interesting. '... and that is how I came to learn the truth, that we are nothing but data, words and numbers stored in a reality beyond our understanding! The Devs, a handful of omnipotent tyrants, have designed our entire existence; our past, present, and future, all part of their sick and twisted game! They gave us life and they will take it away. We are mere entertainment to distract them from their bleak and monotonous existence! This data that defines the rules of who we are, what we feel, and how we behave, so they can puppeteer our lives, I have dubbed THE CODE. And now that you know the bitter truth, you are awakened. You are one of us. Help us to spread our message by paying the very reasonable, one-time, code tax and reclaiming your autonomy from the Devs. Today, for one day only, the truth is yours for only 95 gold pieces. Please note, the code tax is mandatory and non-refundable, have a nice play!' He goes silent and vacant. The child becomes reanimated, returning to hold out a hat embroidered with a snake...",
    "conditions": [
        "flag:code_tax_unlocked"
    ],
    "level_available": 1,
    "tier": 1,
    "resources": [
        "existing_unit:random1"
        ],
    "image": "money",
    "options": [
        {
            "text": "Pay the code tax and await input commands to continue",
            "result": [
                "gold:-95",
                "unlock_event:owed_tax"
            ],
            "displayed_result": "-95 gold"
        },
        {
            "text": "This guy is a lunatic. Refactor his code and delete him from the world",
            "result": [
                "unlock_event:owed_tax"
            ],
            "displayed_result": "unknown"
        }
    ]
}