{
    "type": "plague_here",
    "description": "After marching for a few hours it is approaching midday. The sun is high and relentless, and your troops are ready for a rest and something to eat. Not far off you see a village built on a crossroads adjacent to the forest, the tall, fragrant trees casting a cool shade over the thatched roofs. You are aware of this village, and although it remains modest in size, it is a renowned trading centre for the region. However, it is eerily quiet for this time of day, and the absence of the bustle of workers and traders is all too obvious. The village is silent. As you get closer a rancid stench rises in the summer heat and immediately expels any feeling of hunger amongst your troupe. A feeling of tension rises amongst your troops and your once eager approach slows to an apprehensive walk. As you reach the boundaries of the village you notice rough black marks made above the thresholds of nearby dwellings, and a crude but bold sign stands at the village gate with the words 'Plague Here'. The tension of your troops swells to a climax. Some slowly retreat, others are anxiously whispering at each other, and only a handful retain their resolve and join you in your cautious approach. The eerie silence of the village is now broken by the low rumbles spluttering and retching from dwellings nearby. It is clear that this village has been decimated by disease, and anyone that remained healthy has abandoned the village and likely fled to safety. You are aware that these people need help, and are destined to die without it. However, this also presents a rather prosperous opportunity for those brave and callous enough to seize the opportunity...",
    "conditions": [],
    "level_available": 1,
    "tier": 1,
    "resources": [
        "existing_unit:random1"
        ],
    "options": [
        {
            "text": "Offer what help you can to the people left alive",
            "result": [
                "rations:-1",
                "charisma:1",
                "injury:1@random1"
            ],
            "displayed_result": "unknown"
        },
        {
            "text": "Avoid the town and lead your troupe to safety",
            "result": [
                "charisma:-1",
                "leadership:1"
            ],
            "displayed_result": "unknown"
        },
        {
            "text": "Pillage the town for what resources are left",
            "result": [
                "morale:-1",
                "rations:1",
                "gold:100"
            ],
            "displayed_result": "unknown"
        }
    ]
}