{
    "type": "travelling_merchant",
    "description": "It's been a long day's march and the sun is starting to descend behind the hills in the distance, leaving behind a golden hue that fills your spirit with warmth. As you look around you for the ideal location to set up camp, you notice a man sitting beside the road with a range of items, knick-knacks, and gadgets carefully placed around him. They are labeled with symbols and numbers that are too small to read from this distance. A makeshift sign, tied to a branch above him and swaying gently in the dusk's breeze, simply says 'Shop.' You wonder if the full stop is necessary. 'My, what a fierce and mighty army you have there!', he shouts in a jovial manner as you approach. Glancing around at the state of your men it's fairly obvious he is lying to butter you up. He continues, 'please take a moment to rest and browse the wonders I have available in my shop, full stop!' Did he just say the full stop? The man looks harmless enough and, as a supporter of small business, you order your men to take a break while you see what the man has to offer. He proceeds to introduce himself before you have a chance to ask his name. 'Glorfing's the name, but honestly I have been sued so many times that now I just go by 'the seller', pleased to meet you!' He bows. 'I have many fascinating wares you may be interested in, though unfortunately you have caught me as I am about to pack up, so my stock is a little limited currently. How about some rations for your weary soldiers? Or, if you're looking for something exciting and affordable, 300 gold lets you stick your hand into my magical box and pull out one random piece of equipment to give your men an edge on the battlefield!' He holds up a worn, dog-eared box, and you see the words 'Reduced to Clear' roughly scrawled on one side, despite his best efforts to turn the writing away from you. He stares at you expectantly, awaiting your decision...",
    "conditions": [],
    "level_available": 1,
    "tier": 1,
    "resources": [
        "existing_unit:random1"
        ],
    "options": [
        {
            "text": "Buy some rations for the road",
            "result": [
                "rations:2",
                "gold:-100"
            ],
            "displayed_result": "+2 rations, -100 gold"
        },
        {
            "text": "Buy a mystery item",
            "result": [
                "gold:-300"
            ],
            "displayed_result": "random item, -300 gold"
        },
        {
            "text": "Take your leave without buying anything",
            "result": [],
            "displayed_result": "nothing"
        },
        {
            "text": "Attempt to rob the seller",
            "result": [
                "gold:200",
                "rations:1"
            ],
            "displayed_result": "unknown"
        }
    ]
}